# =========================================================================
# Neovim テキストエディタ宣言的設定モジュール
# =========================================================================
{ config, pkgs, ... }:

{
  # Neovim パッケージの有効化
  programs.neovim = {
    enable = true;
    defaultEditor = true;
    viAlias = true;
    vimAlias = true;
  };

  # -----------------------------------------------------------------------
  # Neovim 設定ディレクトリの宣言的配置 (ディレクトリ・ソース方式)
  # -----------------------------------------------------------------------
  xdg.configFile."nvim".source = ./nvim;
}
